# ColumnAlreadyAttachedWillBeReattached Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..ColumnAlreadyAttachedWillBeReattached Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The column is already attached. It will be detached and attached to the new target.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ColumnAlreadyAttachedWillBeReattached { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnAlreadyAttachedWillBeReattached As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ColumnAlreadyAttachedWillBeReattached {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace